il-prof-f-a/ESP32-OT-Security-Assessment/src/core/configuration_manager.cpp
#include "configuration_manager.h"
#include "logging_system.h"
#include "async_storage_engine.h"
#include "psram_json_parser.h"
#include "psram_json_parser.h"
#include "esp32_ot_generated_credentials.h"
#include <sys/stat.h>
#include <fstream>
#include <stdint.h>
#include <stddef.h>

const char* ConfigurationManager::kNVS_NAMESPACE = "cfg";
const char* ConfigurationManager::kNVS_CRC_KEY   = "config_crc32";
const char* ConfigurationManager::kCONFIG_PATH   = "/data/config/config.json";
const char* ConfigurationManager::kCONFIG_BAK    = "/data/config/config.json.bak";

ConfigurationManager::ConfigurationManager() {
}

ConfigurationManager::~ConfigurationManager() {
    if (root_) cJSON_Delete(root_);
}

bool ConfigurationManager::initialize() {
    // NVS initialization is handled by AsyncStorage engine
    // No direct NVS flash operations needed here

    // Ensure config dir exists using AsyncStorage
    bool dir_exists = false;
    esp_err_t err = AsyncStorage::Global::fileExists("/data/config", dir_exists);
    if (err != ESP_OK || !dir_exists) {
        err = AsyncStorage::Global::createDir("/data/config");
        if (err != ESP_OK) {
            LOG_ERROR("Config", "Failed to create config directory");
            return false;
        }
    }

    // Load configuration source tracking
    loadConfigSourceFromNVS();

    // Configuration loading priority:
    // 1. Prefer filesystem configuration to preserve user changes
    // 2. Fallback to embedded defaults when filesystem is unavailable
    // 3. Then attempt backup, finally regenerate defaults

    bool loaded = false;

    // Prefer filesystem configuration whenever available
    if (loadJSONFromFS()) {
        LOG_INFO("Config", "Using filesystem configuration");
        if (config_source_ != ConfigSource::WEB_INTERFACE && config_source_ != ConfigSource::FILESYSTEM) {
            saveConfigSourceToNVS(ConfigSource::FILESYSTEM);
        }
        loaded = true;
    }

    if (!loaded) {
        LOG_INFO("Config", "Filesystem configuration unavailable, checking embedded defaults");
        if (loadDevConfigFromSource()) {
            saveConfigSourceToNVS(ConfigSource::EMBEDDED);
            loaded = true;
        } else {
            LOG_WARNING("Config", "No embedded config available, trying backup");
        }
    }

    // Fall back to backup
    if (!loaded && tryRecoveryFromBackup()) {
        LOG_INFO("Config", "✅ Recovered from backup configuration");
        saveConfigSourceToNVS(ConfigSource::FILESYSTEM);
        loaded = true;
    }

    // Final fallback to default
    if (!loaded && loadOrCreateDefault()) {
        LOG_INFO("Config", "✅ Using default configuration");
        saveConfigSourceToNVS(ConfigSource::DEFAULT);
        loaded = true;
    }

    if (!loaded) {
        LOG_ERROR("Config", "❌ Failed to load any configuration");
        return false;
    }

    // Validate schema
    if (!validateConfig()) {
        LOG_WARNING("Config","Config invalid, attempting backup recovery");
        if (!tryRecoveryFromBackup()) {
            LOG_WARNING("Config","Keeping current configuration despite validation issues");
        }
    }

    // Cache
    parseAndCache(root_);

    // Ensure all protocol fields are present
    mergeDefaultProtocolFields();

    return true;
}

bool ConfigurationManager::loadJSONFromFS() {
    LOG_INFO("Config", "Attempting to load configuration from filesystem");
    LOG_INFOF("Config", "Loading from path: %s", kCONFIG_PATH);

    std::ifstream ifs(kCONFIG_PATH, std::ios::binary);
    if (!ifs) {
        LOG_WARNING("Config", "Configuration file not found on filesystem");
        return false;
    }

    std::string json((std::istreambuf_iterator<char>(ifs)), {});
    //LOG_INFOF("Config", "Read %u bytes from configuration file", (unsigned)json.length());

    if (root_) cJSON_Delete(root_);
    {
        PSRAMJsonParser::PSRAMContext ctx;
        root_ = PSRAMJsonParser::parseInPSRAM(json.c_str(), json.size());
    }
    if (!root_) {
        LOG_ERROR("Config", "Failed to parse JSON configuration - invalid format");
        return false;
    }

    //LOG_INFO("Config", "✅ Configuration JSON parsed successfully");

    // Update raw cache
    raw_ = PSRAMUtils::createPSRAMString(json.c_str());

    // CRC check
    uint32_t crc = 0;
    if (AsyncStorage::Global::nvsGet(kNVS_NAMESPACE, kNVS_CRC_KEY, crc) == ESP_OK) {
        uint32_t now = crc32((const uint8_t*)json.data(), json.size());
        if (now != crc) {
            LOG_WARNING("Config","CRC mismatch for config.json");
        }
    }
    return true;
}

bool ConfigurationManager::tryRecoveryFromBackup() {
    std::ifstream ifs(kCONFIG_BAK, std::ios::binary);
    if (!ifs) return false;
    std::string json((std::istreambuf_iterator<char>(ifs)), {});
    if (root_) cJSON_Delete(root_);
    {
        PSRAMJsonParser::PSRAMContext ctx;
        root_ = PSRAMJsonParser::parseInPSRAM(json.c_str(), json.size());
    }
    if (!root_) return false;

    // Update raw cache
    raw_ = PSRAMUtils::createPSRAMString(json.c_str());

    // Write configuration file using AsyncStorage
    esp_err_t err = AsyncStorage::Global::writeFileRaw(kCONFIG_PATH, json.data(), json.size());
    if (err != ESP_OK) {
        LOG_ERROR("Config", "Failed to write config file");
        return false;
    }
    return true;
}

bool ConfigurationManager::loadOrCreateDefault() {
    // Minimal default config
    const char* kDefault = R"json(
    )json";

    if (root_) cJSON_Delete(root_);
    {
        PSRAMJsonParser::PSRAMContext ctx;
        root_ = PSRAMJsonParser::parseInPSRAM(kDefault, strlen(kDefault));
    }
    if (!root_) return false;

    // Update raw cache
    raw_ = PSRAMUtils::createPSRAMString(kDefault);

    // Persist default (atomic + CRC)
    psram_string default_json = PSRAMUtils::createPSRAMString(kDefault);
    return saveConfigJSON(default_json);
}


bool ConfigurationManager::saveConfigJSON(const psram_string& json_ps) {

    //LOG_INFO("Config", "Starting configuration save process");

    //LOG_INFOF("Config", "Configuration size: %u bytes", (unsigned)json_ps.size());



    esp_err_t err = AsyncStorage::Global::createDir("/data/config");

    if (err != ESP_OK && err != ESP_ERR_INVALID_ARG) {

        LOG_ERROR("Config", "Failed to ensure config directory exists");

