il-prof-f-a/ESP32-OT-Security-Assessment/src/core/configuration_manager.cpp
        return false;

    }

    //LOG_INFO("Config", "Ensured /data/config directory exists");



    bool file_exists = false;

    AsyncStorage::Global::fileExists(kCONFIG_PATH, file_exists);

    if (file_exists) {

        //LOG_INFO("Config", "Creating backup of existing configuration");

        std::string curr;

        if (AsyncStorage::Global::readFile(kCONFIG_PATH, curr) == ESP_OK) {

            AsyncStorage::Global::writeFileRaw(kCONFIG_BAK, curr.data(), curr.size());

            //LOG_INFOF("Config", "Backup saved to %s (%u bytes)", kCONFIG_BAK, (unsigned)curr.length());

        }

    }



    //LOG_INFOF("Config", "Writing configuration to %s", kCONFIG_PATH);

    err = AsyncStorage::Global::writeFileRaw(kCONFIG_PATH, json_ps.data(), json_ps.size());

    if (err != ESP_OK) {

        LOG_ERROR("Config", "Failed to write configuration to filesystem");

        return false;

    }


    //LOG_INFO("Config", " Configuration written to filesystem successfully");



    //LOG_INFO("Config", "Updating NVS with configuration CRC");

    const uint32_t crc = crc32(reinterpret_cast<const uint8_t*>(json_ps.data()), json_ps.size());

    esp_err_t r = AsyncStorage::Global::nvsSet(kNVS_NAMESPACE, kNVS_CRC_KEY, crc);

    if (r == ESP_OK) {

        //LOG_INFOF("Config", " CRC32 saved to NVS: 0x%08lX", (unsigned long)crc);

    } else {

        LOG_ERRORF("Config", "Failed to save CRC to NVS: %s", esp_err_to_name(r));

    }



    AsyncStorage::Global::nvsSet(kNVS_NAMESPACE, "config_json", json_ps);

    saveConfigSourceToNVS(ConfigSource::WEB_INTERFACE);

    //LOG_INFO("Config", "Configuration saved via web interface - future boots will preserve user changes");



    //LOG_INFO("Config", "Re-parsing and caching configuration");

    if (root_) cJSON_Delete(root_);

    {

        PSRAMJsonParser::PSRAMContext ctx;

        root_ = PSRAMJsonParser::parseInPSRAM(json_ps.c_str(), json_ps.size());

    }

    if (root_) {

        raw_ = json_ps;

        parseAndCache(root_);

        //LOG_INFO("Config", " Configuration parsed and cached successfully");

        return true;

    }



    LOG_ERROR("Config", "Failed to parse saved configuration JSON");

    return false;

}



bool ConfigurationManager::isFeatureEnabled(const char* name, bool default_value) const {
    if (!name || !*name) return default_value;

    // Hard persistence for scheduled scans toggle:
    // If the device reboots/crashes before filesystem write completes, NVS still preserves this flag.
    // Web UI writes it to NVS namespace "cron" key "enabled".
    if (strcmp(name, "scheduled_scans") == 0 || strcmp(name, "cron_scheduler") == 0) {
        uint8_t nvs_enabled = 0;
        if (AsyncStorage::Global::nvsGet("cron", "enabled", nvs_enabled) == ESP_OK) {
            return (nvs_enabled != 0);
        }
    }

    size_t json_size = 0;
    char* json_psram = getRawConfigInPSRAM(&json_size);
    if (!json_psram || json_size == 0) return default_value;
    PSRAMJsonParser::PSRAMContext ctx;
    cJSON* root = PSRAMJsonParser::parseInPSRAM(json_psram, json_size);
    heap_caps_free(json_psram);
    if (!root) return default_value;
    bool enabled = default_value;
    if (strcmp(name, "ids") == 0) {
        cJSON* ids = cJSON_GetObjectItem(root, "ids");
        if (ids && cJSON_IsObject(ids)) {
            cJSON* general = cJSON_GetObjectItem(ids, "general");
            if (general && cJSON_IsObject(general)) {
                cJSON* en = cJSON_GetObjectItem(general, "enabled");
                if (en && cJSON_IsBool(en)) enabled = (en->valueint != 0);
            }
        }
    } else if (strcmp(name, "vuln_scanner") == 0 || strcmp(name, "fuzzing") == 0) {
        cJSON* scanner = cJSON_GetObjectItem(root, "scanner");
        if (scanner && cJSON_IsObject(scanner)) {
            cJSON* en = cJSON_GetObjectItem(scanner, "enabled");
            if (en && cJSON_IsBool(en)) enabled = (en->valueint != 0);
        }
    } else if (strcmp(name, "scheduled_scans") == 0 || strcmp(name, "cron_scheduler") == 0) {
        cJSON* scanner = cJSON_GetObjectItem(root, "scanner");
        if (scanner && cJSON_IsObject(scanner)) {
            cJSON* scheduling = cJSON_GetObjectItem(scanner, "scheduling");
            bool value_set = false;
            if (scheduling && cJSON_IsObject(scheduling)) {
                cJSON* en = cJSON_GetObjectItem(scheduling, "enabled");
                if (en && cJSON_IsBool(en)) {
                    enabled = (en->valueint != 0);
                    value_set = true;
                }
            }
            if (!value_set) {
                cJSON* legacy = cJSON_GetObjectItem(scanner, "scheduler_enabled");
                if (legacy && cJSON_IsBool(legacy)) {
                    enabled = (legacy->valueint != 0);
                    value_set = true;
                }
            }
            if (!value_set) {
                cJSON* en = cJSON_GetObjectItem(scanner, "enabled");
                if (en && cJSON_IsBool(en)) enabled = (en->valueint != 0);
            }
        }
    } else if (strcmp(name, "modbus") == 0 || strcmp(name, "opcua") == 0 || strcmp(name, "s7") == 0 || strcmp(name, "profinet") == 0 || strcmp(name, "ethernetip") == 0) {
        cJSON* plugins = cJSON_GetObjectItem(root, "plugins");
        if (plugins && cJSON_IsObject(plugins)) {
            // Read only the requested plugin block by key = name
            cJSON* plugin = cJSON_GetObjectItem(plugins, name);
            if (plugin && cJSON_IsObject(plugin)) {
                cJSON* en = cJSON_GetObjectItem(plugin, "enabled");
                if (en && cJSON_IsBool(en)) enabled = (en->valueint != 0);
            }
        }
    } else {
        enabled = default_value;
    }
    cJSON_Delete(root);
    return enabled;
}

bool ConfigurationManager::validateConfig() const {
    if (!root_) return false;
    // Very lightweight schema validation
    auto mustBool = [](cJSON* obj, const char* key)->bool{
        auto* it = cJSON_GetObjectItemCaseSensitive(obj, key);
        return it && cJSON_IsBool(it);
    };
    auto mustNumber = [](cJSON* obj, const char* key)->bool{
        auto* it = cJSON_GetObjectItemCaseSensitive(obj, key);
        return it && cJSON_IsNumber(it);
    };
    // Removed unused mustString lambda

    cJSON* debug = cJSON_GetObjectItem(root_, "debug");
    if (!debug || !mustNumber(debug,"level") || !mustBool(debug,"color")) return false;

    cJSON* security = cJSON_GetObjectItem(root_, "security");
    if (!security || !mustBool(security,"secure_boot") || !mustBool(security,"flash_encryption")
        || !mustBool(security,"certificate_validation")) return false;
    cJSON* enforce_opcua = cJSON_GetObjectItemCaseSensitive(security, "opcua_enforce_security");
    if (enforce_opcua && !cJSON_IsBool(enforce_opcua)) return false;

