il-prof-f-a/ESP32-OT-Security-Assessment/src/core/configuration_manager.cpp
    cJSON* network = cJSON_GetObjectItem(root_, "network");
    if (!network) return false;
    cJSON* eth = cJSON_GetObjectItem(network,"ethernet");
    cJSON* wifi = cJSON_GetObjectItem(network,"wifi");
    if (!eth || !wifi) return false;

    auto checkNet = [&](cJSON* obj)->bool{
        if (!mustBool(obj,"enabled") || !mustBool(obj,"dhcp")) return false;
        // optional strings
        const char* keys[] = {"ip","gateway","netmask","ssid","password"};
        for (auto k: keys) {
            cJSON* it = cJSON_GetObjectItemCaseSensitive(obj, k);
            if (it && !cJSON_IsString(it)) return false;
        }
        return true;
    };
    if (!checkNet(eth) || !checkNet(wifi)) return false;

    // plugins object (optional map with enabled flags)
    cJSON* plugins = cJSON_GetObjectItem(root_, "plugins");
    if (plugins && !cJSON_IsObject(plugins)) return false;

    return true;
}

static psram_string jsonStringOrEmpty(cJSON* obj, const char* key) {
    if (!obj || !key) {
        return psram_string{};
    }
    cJSON* it = cJSON_GetObjectItem(obj, key);
    if (it && cJSON_IsString(it) && it->valuestring) {
        return PSRAMUtils::createPSRAMString(it->valuestring);
    }
    return psram_string{};
}

bool ConfigurationManager::parseAndCache(cJSON* root) {
    if (!root) return false;
    // debug
    cJSON* d = cJSON_GetObjectItem(root,"debug");
    if (d) {
        cJSON* lv = cJSON_GetObjectItem(d,"level");
        cJSON* co = cJSON_GetObjectItem(d,"color");
        if (cJSON_IsNumber(lv)) debug_.level = (int)lv->valuedouble;
        if (cJSON_IsBool(co)) debug_.color = cJSON_IsTrue(co);
    }
    // security
    cJSON* s = cJSON_GetObjectItem(root,"security");
    if (s) {
        sec_.alert_policy = SecurityAlertPolicy();
        {
            PSRAMAllocator<psram_string> alloc;
            sec_.alert_policy.email.recipients = psram_string_vector(alloc);
        }
        cJSON* a = cJSON_GetObjectItem(s,"secure_boot");
        cJSON* b = cJSON_GetObjectItem(s,"flash_encryption");
        cJSON* c = cJSON_GetObjectItem(s,"certificate_validation");
        if (cJSON_IsBool(a)) sec_.secure_boot = cJSON_IsTrue(a);
        if (cJSON_IsBool(b)) sec_.flash_encryption = cJSON_IsTrue(b);
        if (cJSON_IsBool(c)) sec_.certificate_validation = cJSON_IsTrue(c);
        cJSON* opcua_enforce = cJSON_GetObjectItem(s, "opcua_enforce_security");
        if (cJSON_IsBool(opcua_enforce)) {
            sec_.opcua_enforce_security = cJSON_IsTrue(opcua_enforce);
        }
        psram_string admin_hash = jsonStringOrEmpty(s, "admin_password_hash");
        if (!admin_hash.empty()) {
            sec_.admin_password = admin_hash;
        } else {
            psram_string legacy_admin = jsonStringOrEmpty(s, "admin_password");
            if (!legacy_admin.empty()) {
                sec_.admin_password = legacy_admin;
            }
        }

        cJSON* alert_policy = cJSON_GetObjectItem(s, "alert_policy");
        if (alert_policy && cJSON_IsObject(alert_policy)) {
            // Email policy
            cJSON* email_obj = cJSON_GetObjectItem(alert_policy, "email");
            if (email_obj && cJSON_IsObject(email_obj)) {
                cJSON* en = cJSON_GetObjectItem(email_obj, "enabled");
                if (cJSON_IsBool(en)) {
                    sec_.alert_policy.email.enabled = cJSON_IsTrue(en);
                }

                cJSON* subject = cJSON_GetObjectItem(email_obj, "subject");
                if (subject && cJSON_IsString(subject) && subject->valuestring) {
                    sec_.alert_policy.email.subject = PSRAMUtils::createPSRAMString(subject->valuestring);
                }

                cJSON* throttle = cJSON_GetObjectItem(email_obj, "throttle_minutes");
                if (throttle && cJSON_IsNumber(throttle)) {
                    double value = throttle->valuedouble;
                    if (value < 0) value = 0;
                    sec_.alert_policy.email.throttle_minutes = static_cast<uint32_t>(value);
                }

                cJSON* recipients = cJSON_GetObjectItem(email_obj, "recipients");
                {
                    PSRAMAllocator<psram_string> alloc;
                    sec_.alert_policy.email.recipients = psram_string_vector(alloc);
                    if (recipients && cJSON_IsArray(recipients)) {
                        cJSON* item = nullptr;
                        cJSON_ArrayForEach(item, recipients) {
                            if (item && cJSON_IsString(item) && item->valuestring) {
                                sec_.alert_policy.email.recipients.push_back(
                                    PSRAMUtils::createPSRAMString(item->valuestring));
                            }
                        }
                    }
                }
            }

            // Webhook policy
            cJSON* webhook_obj = cJSON_GetObjectItem(alert_policy, "webhook");
            if (webhook_obj && cJSON_IsObject(webhook_obj)) {
                cJSON* en = cJSON_GetObjectItem(webhook_obj, "enabled");
                if (cJSON_IsBool(en)) {
                    sec_.alert_policy.webhook.enabled = cJSON_IsTrue(en);
                }
                cJSON* url = cJSON_GetObjectItem(webhook_obj, "url");
                if (url && cJSON_IsString(url) && url->valuestring) {
                    sec_.alert_policy.webhook.url = PSRAMUtils::createPSRAMString(url->valuestring);
                }
                cJSON* token = cJSON_GetObjectItem(webhook_obj, "token");
                if (token && cJSON_IsString(token) && token->valuestring) {
                    sec_.alert_policy.webhook.token = PSRAMUtils::createPSRAMString(token->valuestring);
                }
            }

            // GPIO policy
            cJSON* gpio_obj = cJSON_GetObjectItem(alert_policy, "gpio");
            if (gpio_obj && cJSON_IsObject(gpio_obj)) {
                cJSON* en = cJSON_GetObjectItem(gpio_obj, "enabled");
                if (cJSON_IsBool(en)) {
                    sec_.alert_policy.gpio.enabled = cJSON_IsTrue(en);
                }
                cJSON* critical = cJSON_GetObjectItem(gpio_obj, "critical_pin");
                if (critical && cJSON_IsNumber(critical)) {
                    sec_.alert_policy.gpio.critical_pin = static_cast<uint8_t>(critical->valuedouble);
                }
                cJSON* warning = cJSON_GetObjectItem(gpio_obj, "warning_pin");
                if (warning && cJSON_IsNumber(warning)) {
                    sec_.alert_policy.gpio.warning_pin = static_cast<uint8_t>(warning->valuedouble);
                }
                cJSON* buzzer = cJSON_GetObjectItem(gpio_obj, "buzzer");
                if (!buzzer) buzzer = cJSON_GetObjectItem(gpio_obj, "buzzer_pin");
                if (buzzer && cJSON_IsNumber(buzzer)) {
                    sec_.alert_policy.gpio.buzzer_pin = static_cast<uint8_t>(buzzer->valuedouble);
                }
            }
        }
    }
    // network
    cJSON* n = cJSON_GetObjectItem(root,"network");
    if (n) {
        cJSON* eth = cJSON_GetObjectItem(n,"ethernet");
        cJSON* wf  = cJSON_GetObjectItem(n,"wifi");
        if (eth) {
            cJSON* en = cJSON_GetObjectItem(eth,"enabled");
            cJSON* dh = cJSON_GetObjectItem(eth,"dhcp");
            cJSON* pr = cJSON_GetObjectItem(eth,"promiscuous");
            if (cJSON_IsBool(en)) net_.eth_enabled = cJSON_IsTrue(en);
            if (cJSON_IsBool(dh)) net_.eth_dhcp   = cJSON_IsTrue(dh);
            if (cJSON_IsBool(pr)) net_.eth_promiscuous   = cJSON_IsTrue(pr);
            net_.eth_ip      = jsonStringOrEmpty(eth, "ip");
            net_.eth_gateway = jsonStringOrEmpty(eth, "gateway");
            net_.eth_netmask = jsonStringOrEmpty(eth, "netmask");
        }
        if (wf) {
            cJSON* en = cJSON_GetObjectItem(wf,"enabled");
            cJSON* dh = cJSON_GetObjectItem(wf,"dhcp");
            if (cJSON_IsBool(en)) net_.wifi_enabled = cJSON_IsTrue(en);
            if (cJSON_IsBool(dh)) net_.wifi_dhcp    = cJSON_IsTrue(dh);
            net_.wifi_ssid    = jsonStringOrEmpty(wf, "ssid");
            net_.wifi_password= jsonStringOrEmpty(wf, "password");
            net_.wifi_ip      = jsonStringOrEmpty(wf, "ip");
            net_.wifi_gateway = jsonStringOrEmpty(wf, "gateway");
            net_.wifi_netmask = jsonStringOrEmpty(wf, "netmask");

            // Read DNS and NTP from wifi section (current config.json format)
            psram_string wifi_dns = jsonStringOrEmpty(wf, "dns");
            psram_string wifi_ntp = jsonStringOrEmpty(wf, "ntp");
            if (!wifi_dns.empty()) {
                net_.dns_primary = wifi_dns;
                // Default secondary DNS
                net_.dns_secondary = PSRAMUtils::createPSRAMString("8.8.4.4");
            }
            if (!wifi_ntp.empty()) {
                net_.ntp_primary = wifi_ntp;
                // Default secondary/tertiary NTP
                net_.ntp_secondary = "";//PSRAMUtils::createPSRAMString("pool.ntp.org");
                net_.ntp_tertiary = "";//PSRAMUtils::createPSRAMString("time.nist.gov");
            }

