il-prof-f-a/ESP32-OT-Security-Assessment/src/core/configuration_manager.cpp
            // Read new time synchronization configuration
            net_.time_sync = jsonStringOrEmpty(wf, "time_sync");
            if (net_.time_sync.empty()) {
                net_.time_sync = PSRAMUtils::createPSRAMString("ntp"); // Default to NTP
            }
            net_.http_time_sync = jsonStringOrEmpty(wf, "http_time_sync");
        }

        // Alternative: DNS configuration from separate section (fallback)
        cJSON* dns = cJSON_GetObjectItem(n, "dns");
        if (dns && net_.dns_primary.empty()) {
            net_.dns_primary   = jsonStringOrEmpty(dns, "primary");
            net_.dns_secondary = jsonStringOrEmpty(dns, "secondary");
        }

        // Alternative: NTP configuration from separate section (fallback)
        cJSON* ntp = cJSON_GetObjectItem(n, "ntp");
        if (ntp && net_.ntp_primary.empty()) {
            net_.ntp_primary   = jsonStringOrEmpty(ntp, "primary");
            net_.ntp_secondary = jsonStringOrEmpty(ntp, "secondary");
            net_.ntp_tertiary  = jsonStringOrEmpty(ntp, "tertiary");
        }
    }

    // IDS configuration (consolidated under "ids" key)
    cJSON* ids_root = cJSON_GetObjectItem(root,"ids");

    // LEGACY: Support old "advanced_ids" for backward compatibility
    cJSON* ids = cJSON_GetObjectItem(root,"advanced_ids");
    if (!ids_root && ids) {
        ids_root = ids; // Fallback to legacy structure
    }

    if (ids_root) {
        ids_anomaly_ = IDSAnomalyConfig();
        // Try new structure first
        cJSON* general = cJSON_GetObjectItem(ids_root, "general");
        if (!general && ids_root == ids) {
            // Legacy structure - use root directly
            general = ids_root;
        }

        if (general) {
            cJSON* enabled = cJSON_GetObjectItem(general,"enabled");
            cJSON* modbus = cJSON_GetObjectItem(general,"max_per_sec_modbus");
            cJSON* s7 = cJSON_GetObjectItem(general,"max_per_sec_s7");
            cJSON* enip = cJSON_GetObjectItem(general,"max_per_sec_enip");
            cJSON* pn = cJSON_GetObjectItem(general,"max_per_sec_pn");
            cJSON* opcua = cJSON_GetObjectItem(general,"max_per_sec_opcua");
            cJSON* replay = cJSON_GetObjectItem(general,"replay_window_ms");

            if (cJSON_IsBool(enabled)) ids_.enabled = cJSON_IsTrue(enabled);
            if (cJSON_IsNumber(modbus)) ids_.max_per_sec_modbus = (uint32_t)modbus->valuedouble;
            if (cJSON_IsNumber(s7)) ids_.max_per_sec_s7 = (uint32_t)s7->valuedouble;
            if (cJSON_IsNumber(enip)) ids_.max_per_sec_enip = (uint32_t)enip->valuedouble;
            if (cJSON_IsNumber(pn)) ids_.max_per_sec_pn = (uint32_t)pn->valuedouble;
            if (cJSON_IsNumber(opcua)) ids_.max_per_sec_opcua = (uint32_t)opcua->valuedouble;
            if (cJSON_IsNumber(replay)) ids_.replay_window_ms = (uint32_t)replay->valuedouble;
            // moved: alert_modbus_broadcast_write now under ids.protocol_specific.modbus.alert_broadcast_write
        }

        cJSON* anomaly = cJSON_GetObjectItem(ids_root, "anomaly");
        if (anomaly && cJSON_IsObject(anomaly)) {
            cJSON* flooding = cJSON_GetObjectItem(anomaly, "flooding_pps_threshold");
            if (cJSON_IsNumber(flooding) && flooding->valuedouble > 0.0) {
                ids_anomaly_.flooding_pps_threshold = (float)flooding->valuedouble;
            }

            cJSON* req_sec = cJSON_GetObjectItem(anomaly, "requests_per_second_threshold");
            if (cJSON_IsNumber(req_sec) && req_sec->valuedouble > 0.0) {
                ids_anomaly_.requests_per_second_threshold = (float)req_sec->valuedouble;
            }

            cJSON* rr_high = cJSON_GetObjectItem(anomaly, "request_response_high_ratio");
            if (cJSON_IsNumber(rr_high) && rr_high->valuedouble > 0.0) {
                ids_anomaly_.request_response_high_ratio = (float)rr_high->valuedouble;
            }

            cJSON* rr_low = cJSON_GetObjectItem(anomaly, "request_response_low_ratio");
            if (cJSON_IsNumber(rr_low) && rr_low->valuedouble > 0.0) {
                ids_anomaly_.request_response_low_ratio = (float)rr_low->valuedouble;
            }

            cJSON* malformed_norm = cJSON_GetObjectItem(anomaly, "malformed_packets_normalizer");
            if (cJSON_IsNumber(malformed_norm) && malformed_norm->valuedouble > 0.0) {
                ids_anomaly_.malformed_packets_normalizer = (float)malformed_norm->valuedouble;
            }

            cJSON* cooldown_ms = cJSON_GetObjectItem(anomaly, "reactive_fuzzing_cooldown_ms");
            if (cJSON_IsNumber(cooldown_ms) && cooldown_ms->valuedouble > 0.0) {
                ids_anomaly_.reactive_fuzzing_cooldown_ms = (uint32_t)cooldown_ms->valuedouble;
            }
            cJSON* cooldown_min = cJSON_GetObjectItem(anomaly, "reactive_fuzzing_cooldown_minutes");
            if (cJSON_IsNumber(cooldown_min) && cooldown_min->valuedouble > 0.0) {
                ids_anomaly_.reactive_fuzzing_cooldown_ms = (uint32_t)(cooldown_min->valuedouble * 60000.0);
            }

            cJSON* retention_ms = cJSON_GetObjectItem(anomaly, "reactive_fuzzing_retention_ms");
            if (cJSON_IsNumber(retention_ms) && retention_ms->valuedouble > 0.0) {
                ids_anomaly_.reactive_fuzzing_retention_ms = (uint32_t)retention_ms->valuedouble;
            }
            cJSON* retention_min = cJSON_GetObjectItem(anomaly, "reactive_fuzzing_retention_minutes");
            if (cJSON_IsNumber(retention_min) && retention_min->valuedouble > 0.0) {
                ids_anomaly_.reactive_fuzzing_retention_ms = (uint32_t)(retention_min->valuedouble * 60000.0);
            }
        }

        // Writers configuration (new structure only)
        cJSON* writers = cJSON_GetObjectItem(ids_root, "writers");
        if (writers) {
            cJSON* allowed_ips = cJSON_GetObjectItem(writers, "allowed_ips");
            if (cJSON_IsArray(allowed_ips)) {
                writers_.allowed_ips.clear();
                cJSON* ip = nullptr;
                cJSON_ArrayForEach(ip, allowed_ips) {
                    if (cJSON_IsString(ip)) {
                        writers_.allowed_ips.emplace_back(PSRAMUtils::createPSRAMString(ip->valuestring));
                    }
                }
            }

            cJSON* allowed_macs = cJSON_GetObjectItem(writers, "allowed_macs");
            if (cJSON_IsArray(allowed_macs)) {
                writers_.allowed_macs.clear();
                cJSON* mac = nullptr;
                cJSON_ArrayForEach(mac, allowed_macs) {
                    if (cJSON_IsString(mac)) {
                        writers_.allowed_macs.emplace_back(PSRAMUtils::createPSRAMString(mac->valuestring));
                    }
                }
            }
        }

