il-prof-f-a/ESP32-OT-Security-Assessment/src/core/configuration_manager.cpp
        // Network presence configuration (moved from top-level)
        cJSON* network_presence_new = cJSON_GetObjectItem(ids_root, "network_presence");
        if (network_presence_new) {
            cJSON* enabled = cJSON_GetObjectItem(network_presence_new,"enabled");
            cJSON* learning_mode = cJSON_GetObjectItem(network_presence_new,"learning_mode");
            cJSON* alert_unauthorized = cJSON_GetObjectItem(network_presence_new,"alert_unauthorized_writes");
            cJSON* track_all = cJSON_GetObjectItem(network_presence_new,"track_all_traffic");
            cJSON* cleanup_interval = cJSON_GetObjectItem(network_presence_new,"cleanup_interval_ms");
            cJSON* inactive_timeout = cJSON_GetObjectItem(network_presence_new,"inactive_device_timeout_ms");
            cJSON* activation_delay = cJSON_GetObjectItem(network_presence_new,"activation_delay_minutes");
            cJSON* retention_days = cJSON_GetObjectItem(network_presence_new,"retention_days");
            cJSON* trust_threshold = cJSON_GetObjectItem(network_presence_new,"trust_threshold_score");
            cJSON* observation_period = cJSON_GetObjectItem(network_presence_new,"min_observation_period_hours");
            cJSON* continuity_weight = cJSON_GetObjectItem(network_presence_new,"continuity_weight");
            cJSON* diversity_weight = cJSON_GetObjectItem(network_presence_new,"diversity_weight");
            cJSON* frequency_weight = cJSON_GetObjectItem(network_presence_new,"frequency_weight");

            if (cJSON_IsBool(enabled)) network_presence_.enabled = cJSON_IsTrue(enabled);
            if (cJSON_IsBool(learning_mode)) network_presence_.learning_mode = cJSON_IsTrue(learning_mode);
            if (cJSON_IsBool(alert_unauthorized)) network_presence_.alert_unauthorized_writes = cJSON_IsTrue(alert_unauthorized);
            if (cJSON_IsBool(track_all)) network_presence_.track_all_traffic = cJSON_IsTrue(track_all);
            if (cJSON_IsNumber(cleanup_interval)) network_presence_.cleanup_interval_ms = (uint32_t)cleanup_interval->valuedouble;
            if (cJSON_IsNumber(inactive_timeout)) network_presence_.inactive_device_timeout_ms = (uint32_t)inactive_timeout->valuedouble;
            if (cJSON_IsNumber(activation_delay)) network_presence_.activation_delay_minutes = (uint32_t)activation_delay->valuedouble;
            if (cJSON_IsNumber(retention_days)) network_presence_.retention_days = (uint32_t)retention_days->valuedouble;
            if (cJSON_IsNumber(trust_threshold)) network_presence_.trust_threshold_score = trust_threshold->valuedouble;
            if (cJSON_IsNumber(observation_period)) network_presence_.min_observation_period_hours = (uint32_t)observation_period->valuedouble;
            if (cJSON_IsNumber(continuity_weight)) network_presence_.continuity_weight = continuity_weight->valuedouble;
            if (cJSON_IsNumber(diversity_weight)) network_presence_.diversity_weight = diversity_weight->valuedouble;
            if (cJSON_IsNumber(frequency_weight)) network_presence_.frequency_weight = frequency_weight->valuedouble;
        }
    }

    // writers_config
    cJSON* writers = cJSON_GetObjectItem(root,"writers_config");
    if (writers) {
        cJSON* enabled = cJSON_GetObjectItem(writers,"enabled");
        cJSON* alert = cJSON_GetObjectItem(writers,"alert_unauthorized_writes");
        cJSON* track = cJSON_GetObjectItem(writers,"track_all_senders");
        cJSON* cleanup = cJSON_GetObjectItem(writers,"cleanup_interval_ms");
        cJSON* timeout = cJSON_GetObjectItem(writers,"inactive_sender_timeout_ms");
        cJSON* allowed = cJSON_GetObjectItem(writers,"allowed_writers");

        if (cJSON_IsBool(enabled)) writers_.enabled = cJSON_IsTrue(enabled);
        if (cJSON_IsBool(alert)) writers_.alert_unauthorized_writes = cJSON_IsTrue(alert);
        if (cJSON_IsBool(track)) writers_.track_all_senders = cJSON_IsTrue(track);
        if (cJSON_IsNumber(cleanup)) writers_.cleanup_interval_ms = (uint32_t)cleanup->valuedouble;
        if (cJSON_IsNumber(timeout)) writers_.inactive_sender_timeout_ms = (uint32_t)timeout->valuedouble;

        if (allowed && cJSON_IsArray(allowed)) {
            writers_.allowed_writers.clear();
            cJSON* item = nullptr;
            cJSON_ArrayForEach(item, allowed) {
                if (cJSON_IsString(item)) {
                    writers_.allowed_writers.emplace_back(PSRAMUtils::createPSRAMString(item->valuestring));
                }
            }
        }
    }

    // LEGACY: network_presence configuration (now moved to ids.network_presence)
    cJSON* network_presence = cJSON_GetObjectItem(root,"network_presence");
    if (network_presence && !cJSON_GetObjectItem(ids_root, "network_presence")) {
        // Only use legacy if new structure not found
        cJSON* enabled = cJSON_GetObjectItem(network_presence,"enabled");
        cJSON* learning_mode = cJSON_GetObjectItem(network_presence,"learning_mode");
        cJSON* alert_unauthorized = cJSON_GetObjectItem(network_presence,"alert_unauthorized_writes");
        cJSON* track_all = cJSON_GetObjectItem(network_presence,"track_all_traffic");
        cJSON* cleanup_interval = cJSON_GetObjectItem(network_presence,"cleanup_interval_ms");
        cJSON* inactive_timeout = cJSON_GetObjectItem(network_presence,"inactive_device_timeout_ms");
        cJSON* activation_delay = cJSON_GetObjectItem(network_presence,"activation_delay_minutes");
        cJSON* retention_days = cJSON_GetObjectItem(network_presence,"retention_days");
        cJSON* trust_threshold = cJSON_GetObjectItem(network_presence,"trust_threshold_score");
        cJSON* observation_period = cJSON_GetObjectItem(network_presence,"min_observation_period_hours");
        cJSON* continuity_weight = cJSON_GetObjectItem(network_presence,"continuity_weight");
        cJSON* diversity_weight = cJSON_GetObjectItem(network_presence,"diversity_weight");
        cJSON* frequency_weight = cJSON_GetObjectItem(network_presence,"frequency_weight");

        if (cJSON_IsBool(enabled)) network_presence_.enabled = cJSON_IsTrue(enabled);
        if (cJSON_IsBool(learning_mode)) network_presence_.learning_mode = cJSON_IsTrue(learning_mode);
        if (cJSON_IsBool(alert_unauthorized)) network_presence_.alert_unauthorized_writes = cJSON_IsTrue(alert_unauthorized);
        if (cJSON_IsBool(track_all)) network_presence_.track_all_traffic = cJSON_IsTrue(track_all);
        if (cJSON_IsNumber(cleanup_interval)) network_presence_.cleanup_interval_ms = (uint32_t)cleanup_interval->valuedouble;
        if (cJSON_IsNumber(inactive_timeout)) network_presence_.inactive_device_timeout_ms = (uint32_t)inactive_timeout->valuedouble;
        if (cJSON_IsNumber(activation_delay)) network_presence_.activation_delay_minutes = (uint32_t)activation_delay->valuedouble;
        if (cJSON_IsNumber(retention_days)) network_presence_.retention_days = (uint32_t)retention_days->valuedouble;
        if (cJSON_IsNumber(trust_threshold)) network_presence_.trust_threshold_score = trust_threshold->valuedouble;
        if (cJSON_IsNumber(observation_period)) network_presence_.min_observation_period_hours = (uint32_t)observation_period->valuedouble;
        if (cJSON_IsNumber(continuity_weight)) network_presence_.continuity_weight = continuity_weight->valuedouble;
        if (cJSON_IsNumber(diversity_weight)) network_presence_.diversity_weight = diversity_weight->valuedouble;
        if (cJSON_IsNumber(frequency_weight)) network_presence_.frequency_weight = frequency_weight->valuedouble;
    }

    // watchdog
    cJSON* watchdog = cJSON_GetObjectItem(root,"watchdog");
    if (watchdog) {
        cJSON* enabled = cJSON_GetObjectItem(watchdog,"enabled");
        cJSON* timeout_sec = cJSON_GetObjectItem(watchdog,"timeout_seconds");
        cJSON* panic = cJSON_GetObjectItem(watchdog,"panic_on_timeout");
        cJSON* idle = cJSON_GetObjectItem(watchdog,"monitor_idle_cores");

        if (cJSON_IsBool(enabled)) watchdog_.enabled = cJSON_IsTrue(enabled);
        if (cJSON_IsNumber(timeout_sec)) watchdog_.timeout_seconds = (uint32_t)timeout_sec->valuedouble;
        if (cJSON_IsBool(panic)) watchdog_.panic_on_timeout = cJSON_IsTrue(panic);
        if (cJSON_IsBool(idle)) watchdog_.monitor_idle_cores = cJSON_IsTrue(idle);
    }

    // GPIO Reporter configuration (from reporting.gpio section)
    cJSON* reporting = cJSON_GetObjectItem(root, "reporting");
    if (reporting && cJSON_IsObject(reporting)) {
        cJSON* gpio_rep = cJSON_GetObjectItem(reporting, "gpio");
        if (gpio_rep && cJSON_IsObject(gpio_rep)) {
            // Main GPIO settings
            cJSON* gpio_enabled = cJSON_GetObjectItem(gpio_rep, "enabled");
            cJSON* gpio_format = cJSON_GetObjectItem(gpio_rep, "format");
            cJSON* gpio_verbosity = cJSON_GetObjectItem(gpio_rep, "verbosity");

            if (cJSON_IsBool(gpio_enabled)) gpio_.enabled = cJSON_IsTrue(gpio_enabled);
            if (cJSON_IsString(gpio_format)) gpio_.format = PSRAMUtils::createPSRAMString(gpio_format->valuestring);
            if (cJSON_IsString(gpio_verbosity)) gpio_.verbosity = PSRAMUtils::createPSRAMString(gpio_verbosity->valuestring);

            // GPIO Pin Configuration
            cJSON* config = cJSON_GetObjectItem(gpio_rep, "configuration");
            if (config && cJSON_IsObject(config)) {
                cJSON* pins = cJSON_GetObjectItem(config, "pins");
                if (pins && cJSON_IsObject(pins)) {
                    cJSON* led_critical = cJSON_GetObjectItem(pins, "led_critical");
                    cJSON* led_warning = cJSON_GetObjectItem(pins, "led_warning");
                    cJSON* led_info = cJSON_GetObjectItem(pins, "led_info");
                    cJSON* led_success = cJSON_GetObjectItem(pins, "led_success");
                    cJSON* buzzer = cJSON_GetObjectItem(pins, "buzzer");
                    cJSON* btn_acknowledge = cJSON_GetObjectItem(pins, "btn_acknowledge");
                    cJSON* btn_reset = cJSON_GetObjectItem(pins, "btn_reset");
                    cJSON* btn_learning = cJSON_GetObjectItem(pins, "btn_learning");
                    cJSON* btn_maintenance = cJSON_GetObjectItem(pins, "btn_maintenance");

                    if (cJSON_IsNumber(led_critical)) gpio_.pins.led_critical = (uint8_t)led_critical->valuedouble;
                    if (cJSON_IsNumber(led_warning)) gpio_.pins.led_warning = (uint8_t)led_warning->valuedouble;
                    if (cJSON_IsNumber(led_info)) gpio_.pins.led_info = (uint8_t)led_info->valuedouble;
                    if (cJSON_IsNumber(led_success)) gpio_.pins.led_success = (uint8_t)led_success->valuedouble;
                    if (cJSON_IsNumber(buzzer)) gpio_.pins.buzzer = (uint8_t)buzzer->valuedouble;
                    if (cJSON_IsNumber(btn_acknowledge)) gpio_.pins.btn_acknowledge = (uint8_t)btn_acknowledge->valuedouble;
                    if (cJSON_IsNumber(btn_reset)) gpio_.pins.btn_reset = (uint8_t)btn_reset->valuedouble;
                    if (cJSON_IsNumber(btn_learning)) gpio_.pins.btn_learning = (uint8_t)btn_learning->valuedouble;
                    if (cJSON_IsNumber(btn_maintenance)) gpio_.pins.btn_maintenance = (uint8_t)btn_maintenance->valuedouble;
                }

                // GPIO Behavior Configuration
                cJSON* behavior = cJSON_GetObjectItem(config, "behavior");
                if (behavior && cJSON_IsObject(behavior)) {
                    cJSON* buzzer_enabled = cJSON_GetObjectItem(behavior, "buzzer_enabled");
                    cJSON* alert_duration = cJSON_GetObjectItem(behavior, "alert_duration_ms");
                    cJSON* blink_interval = cJSON_GetObjectItem(behavior, "blink_interval_ms");
                    cJSON* debounce = cJSON_GetObjectItem(behavior, "debounce_ms");

                    if (cJSON_IsBool(buzzer_enabled)) gpio_.behavior.buzzer_enabled = cJSON_IsTrue(buzzer_enabled);
                    if (cJSON_IsNumber(alert_duration)) gpio_.behavior.alert_duration_ms = (uint32_t)alert_duration->valuedouble;
                    if (cJSON_IsNumber(blink_interval)) gpio_.behavior.blink_interval_ms = (uint32_t)blink_interval->valuedouble;
                    if (cJSON_IsNumber(debounce)) gpio_.behavior.debounce_ms = (uint32_t)debounce->valuedouble;
                }
            }

