il-prof-f-a/ESP32-OT-Security-Assessment/src/core/configuration_manager.cpp
            // GPIO Filters Configuration
            cJSON* filters = cJSON_GetObjectItem(gpio_rep, "filters");
            if (filters && cJSON_IsObject(filters)) {
                cJSON* filters_enabled = cJSON_GetObjectItem(filters, "enabled");
                cJSON* case_sensitive = cJSON_GetObjectItem(filters, "case_sensitive");

                if (cJSON_IsBool(filters_enabled)) gpio_.filters.enabled = cJSON_IsTrue(filters_enabled);
                if (cJSON_IsBool(case_sensitive)) gpio_.filters.case_sensitive = cJSON_IsTrue(case_sensitive);

                // Include filters
                cJSON* include = cJSON_GetObjectItem(filters, "include");
                if (include && cJSON_IsArray(include)) {
                    gpio_.filters.include.clear();
                    int include_size = cJSON_GetArraySize(include);
                    for (int i = 0; i < include_size; i++) {
                        cJSON* item = cJSON_GetArrayItem(include, i);
                        if (cJSON_IsString(item)) {
                            gpio_.filters.include.push_back(PSRAMUtils::createPSRAMString(item->valuestring));
                        }
                    }
                }

                // Exclude filters
                cJSON* exclude = cJSON_GetObjectItem(filters, "exclude");
                if (exclude && cJSON_IsArray(exclude)) {
                    gpio_.filters.exclude.clear();
                    int exclude_size = cJSON_GetArraySize(exclude);
                    for (int i = 0; i < exclude_size; i++) {
                        cJSON* item = cJSON_GetArrayItem(exclude, i);
                        if (cJSON_IsString(item)) {
                            gpio_.filters.exclude.push_back(PSRAMUtils::createPSRAMString(item->valuestring));
                        }
                    }
                }
            }
        }
    }

    return true;
}

static cJSON* get_path_object(cJSON* root, const char* path) {
    if (!root || !path || !*path) return nullptr;
    const char* p = path;
    cJSON* cur = root;
    char key[64];
    while (*p) {
        size_t k = 0;
        while (*p && *p != '.' && k < sizeof(key)-1) key[k++] = *p++;
        key[k] = '\0';
        if (*p == '.') p++;
        cur = cJSON_GetObjectItem(cur, key);
        if (!cur) return nullptr;
    }
    return cur;
}

bool ConfigurationManager::getBoolAtPath(const char* path, bool* out) const {
    if (!path || !out) return false;
    size_t sz = 0; char* buf = getRawConfigInPSRAM(&sz);
    if (!buf || !sz) return false;
    PSRAMJsonParser::PSRAMContext ctx;
    cJSON* root = PSRAMJsonParser::parseInPSRAM(buf, sz);
    heap_caps_free(buf);
    if (!root) return false;
    cJSON* obj = get_path_object(root, path);
    bool ok = obj && cJSON_IsBool(obj);
    if (ok) *out = cJSON_IsTrue(obj);
    cJSON_Delete(root);
    return ok;
}

bool ConfigurationManager::getStringAtPath(const char* path, char* out, size_t out_sz) const {
    if (!path || !out || !out_sz) return false;
    size_t sz = 0; char* buf = getRawConfigInPSRAM(&sz);
    if (!buf || !sz) return false;
    PSRAMJsonParser::PSRAMContext ctx;
    cJSON* root = PSRAMJsonParser::parseInPSRAM(buf, sz);
    heap_caps_free(buf);
    if (!root) return false;
    cJSON* obj = get_path_object(root, path);
    bool ok = obj && cJSON_IsString(obj);
    if (ok) { strncpy(out, obj->valuestring ? obj->valuestring : "", out_sz-1); out[out_sz-1] = '\0'; }
    cJSON_Delete(root);
    return ok;
}

DebugConfig ConfigurationManager::getDebugConfig() const { return debug_; }
SecurityConfig ConfigurationManager::getSecurityConfig() const { return sec_; }
NetworkConfig ConfigurationManager::getNetworkConfig() const { return net_; }
IDSConfig ConfigurationManager::getIDSConfig() const { return ids_; }
IDSAnomalyConfig ConfigurationManager::getIDSAnomalyConfig() const { return ids_anomaly_; }
WritersConfig ConfigurationManager::getWritersConfig() const { return writers_; }
NetworkPresenceConfig ConfigurationManager::getNetworkPresenceConfig() const { return network_presence_; }
WatchdogConfig ConfigurationManager::getWatchdogConfig() const { return watchdog_; }
GpioReportingConfig ConfigurationManager::getGpioReportingConfig() const { return gpio_; }

AuditManagerConfig ConfigurationManager::getAuditManagerConfig() const {
    AuditManagerConfig config;
    if (!root_) return config;

    cJSON* audit = cJSON_GetObjectItem(root_, "audit");
    if (!audit) return config;

    // Parse enabled flag
    cJSON* enabled = cJSON_GetObjectItem(audit, "enabled");
    if (enabled && cJSON_IsBool(enabled)) {
        config.enabled = cJSON_IsTrue(enabled);
    }

    // Parse logging configuration
    cJSON* logging = cJSON_GetObjectItem(audit, "logging");
    if (logging && cJSON_IsObject(logging)) {
        cJSON* item;
        if ((item = cJSON_GetObjectItem(logging, "log_denied")) && cJSON_IsBool(item)) {
            config.logging.log_denied = cJSON_IsTrue(item);
        }
        if ((item = cJSON_GetObjectItem(logging, "log_timeouts")) && cJSON_IsBool(item)) {
            config.logging.log_timeouts = cJSON_IsTrue(item);
        }
        if ((item = cJSON_GetObjectItem(logging, "log_ratelimits")) && cJSON_IsBool(item)) {
            config.logging.log_ratelimits = cJSON_IsTrue(item);
        }
        if ((item = cJSON_GetObjectItem(logging, "log_system_events")) && cJSON_IsBool(item)) {
            config.logging.log_system_events = cJSON_IsTrue(item);
        }
        if ((item = cJSON_GetObjectItem(logging, "log_security_events")) && cJSON_IsBool(item)) {
            config.logging.log_security_events = cJSON_IsTrue(item);
        }
        if ((item = cJSON_GetObjectItem(logging, "log_config_changes")) && cJSON_IsBool(item)) {
            config.logging.log_config_changes = cJSON_IsTrue(item);
        }
    }

    // Parse rate limiting configuration
    cJSON* rate_limiting = cJSON_GetObjectItem(audit, "rate_limiting");
    if (rate_limiting && cJSON_IsObject(rate_limiting)) {
        cJSON* max_events = cJSON_GetObjectItem(rate_limiting, "max_events_per_second");
        if (max_events && cJSON_IsNumber(max_events)) {
            config.rate_limiting.max_events_per_second = static_cast<uint32_t>(cJSON_GetNumberValue(max_events));
        }
    }

    return config;
}

