il-prof-f-a/ESP32-OT-Security-Assessment/src/core/configuration_manager.cpp
psram_string_map ConfigurationManager::getProtocolConfig(ProtocolType p) const {
    psram_string_map out;
    if (!root_) return out;
    cJSON* plugins = cJSON_GetObjectItem(root_,"plugins");
    if (!plugins) return out;
    const char* key = nullptr;
    switch(p) {
        case ProtocolType::OPC_UA: key = "opcua"; break;
        case ProtocolType::MODBUS_TCP: key = "modbus"; break;
        case ProtocolType::S7_COMM: key = "s7"; break;
        case ProtocolType::PROFINET: key = "profinet"; break;
        case ProtocolType::ETHERNET_IP: key = "ethernetip"; break;
        default: key = "custom"; break;
    }
    cJSON* obj = cJSON_GetObjectItem(plugins, key);
    if (obj && cJSON_IsObject(obj)) {
        cJSON* it = nullptr;
        cJSON_ArrayForEach(it, obj) {
            if (cJSON_IsString(it) || cJSON_IsNumber(it) || cJSON_IsBool(it)) {
                psram_string key = PSRAMUtils::createPSRAMString(it->string ? it->string : "");
                if (cJSON_IsString(it)) {
                    psram_string value = PSRAMUtils::createPSRAMString(it->valuestring ? it->valuestring : "");
                    out[key] = value;
                } else if (cJSON_IsNumber(it)) {
                    std::string temp = std::to_string(it->valuedouble);
                    psram_string value = PSRAMUtils::toPSRAMString(temp);
                    out[key] = value;
                } else {
                    psram_string value = PSRAMUtils::createPSRAMString(cJSON_IsTrue(it) ? "true" : "false");
                    out[key] = value;
                }
            }
        }
    }

    // Add IDS protocol-specific settings from new consolidated structure
    if (p == ProtocolType::PROFINET || p == ProtocolType::MODBUS_TCP) {
        cJSON* ids_root = cJSON_GetObjectItem(root_, "ids");
        if (ids_root) {
            cJSON* protocol_specific = cJSON_GetObjectItem(ids_root, "protocol_specific");
            if (protocol_specific) {
                const char* key = (p==ProtocolType::PROFINET)?"profinet":"modbus";
                cJSON* ids_obj = cJSON_GetObjectItem(protocol_specific, key);
                if (ids_obj && cJSON_IsObject(ids_obj)) {
                    cJSON* it = nullptr;
                    cJSON_ArrayForEach(it, ids_obj) {
                        if (cJSON_IsString(it) || cJSON_IsNumber(it) || cJSON_IsBool(it)) {
                            psram_string profinet_key = PSRAMUtils::createPSRAMString(it->string ? it->string : "");
                            if (cJSON_IsString(it)) {
                                psram_string profinet_value = PSRAMUtils::createPSRAMString(it->valuestring ? it->valuestring : "");
                                out[profinet_key] = profinet_value;
                            } else if (cJSON_IsNumber(it)) {
                                std::string temp = std::to_string(it->valuedouble);
                                psram_string profinet_value = PSRAMUtils::toPSRAMString(temp);
                                out[profinet_key] = profinet_value;
                            } else {
                                psram_string profinet_value = PSRAMUtils::createPSRAMString(cJSON_IsTrue(it) ? "true" : "false");
                                out[profinet_key] = profinet_value;
                            }
                        }
                    }
                }
            }
        }
    }

    return out;
}


// Simple CRC32 (poly 0xEDB88320)
uint32_t ConfigurationManager::crc32(const uint8_t* data, size_t len) const {
    uint32_t crc = 0xFFFFFFFFu;
    for (size_t i=0;i<len;++i) {
        crc ^= data[i];
        for (int j=0;j<8;++j) {
            uint32_t mask = -(crc & 1u);
            crc = (crc >> 1) ^ (0xEDB88320u & mask);
        }
    }
    return ~crc;
}

bool ConfigurationManager::saveConfigSourceToNVS(ConfigSource source) {
    esp_err_t err = AsyncStorage::Global::nvsSet(kNVS_NAMESPACE, "config_source",
                                                static_cast<uint32_t>(source));
    if (err == ESP_OK) {
        config_source_ = source;
        //LOG_INFOF("Config", "Configuration source set to: %d", (int)source);
        return true;
    }
    LOG_ERRORF("Config", "Failed to save config_source to NVS: %s", esp_err_to_name(err));
    return false;
}

ConfigurationManager::ConfigSource ConfigurationManager::loadConfigSourceFromNVS() {
    uint8_t source_val = (uint8_t)ConfigSource::DEFAULT;
    if (AsyncStorage::Global::nvsGet(kNVS_NAMESPACE, "config_source", source_val) == ESP_OK) {
        config_source_ = (ConfigSource)source_val;
        LOG_INFOF("Config", "Loaded configuration source from NVS: %d", (int)config_source_);
    } else {
        LOG_INFO("Config", "No configuration source in NVS, using DEFAULT");
        config_source_ = ConfigSource::DEFAULT;
    }
    return config_source_;
}

void ConfigurationManager::mergeDefaultProtocolFields() {
    if (!root_) return;

    // Get or create plugins object
    cJSON* plugins = cJSON_GetObjectItem(root_, "plugins");
    if (!plugins) {
        plugins = cJSON_CreateObject();
        cJSON_AddItemToObject(root_, "plugins", plugins);
    }

    // Default protocol configurations
    struct ProtocolField {
        const char* key;
        const char* value;
        bool is_bool;
    };

    static const ProtocolField modbus_fields[] = {
        {"enabled", "true", true},
        {"default_unit_id", "1", false},
        {"connect_timeout_ms", "1500", false},
        {"io_timeout_ms", "1500", false},
        {"allowed_writers", "", false},
        {"discovery_connect_timeout_ms", "3000", false},
        {"discovery_io_timeout_ms", "3000", false},
        {"discovery_request_retries", "3", false},
        {"discovery_connect_retries", "2", false},
        {"discovery_prescan_enabled", "true", true},
        {"discovery_prescan_timeout_ms", "400", false},
        {"discovery_probe_coils_max", "16", false},
        {"discovery_unit_ids", "1,2,3,4,5,6,7,8,9,10,16,17,32,64,255", false}
    };

    static const ProtocolField s7_fields[] = {
        {"enabled", "true", true},
        {"default_port", "102", false},
        {"connect_timeout", "2000", false},
        {"pdu_size", "240", false},
        {"discovery_lightweight", "true", true},
        {"discovery_host_delay_ms", "150", false},
        {"discovery_pause_every_hosts", "12", false},
        {"discovery_pause_ms", "600", false}
    };

    static const ProtocolField opcua_fields[] = {
        {"enabled", "true", true},
        {"port", "4840", false},
        {"timeout", "5000", false}
    };

    static const ProtocolField profinet_fields[] = {
        {"enabled", "false", true},
        {"dcp_timeout", "1000", false},
        {"vlan_priority", "7", false}
    };

    static const ProtocolField ethernetip_fields[] = {
        {"enabled", "false", true},
        {"tcp_port", "44818", false},
        {"udp_port", "2222", false},
        {"timeout", "3000", false}
    };

