il-prof-f-a/ESP32-OT-Security-Assessment/src/core/configuration_manager.cpp
    struct ProtocolDefaults {
        const char* name;
        const ProtocolField* fields;
        size_t field_count;
    };

    const ProtocolDefaults defaults[] = {
        {"modbus", modbus_fields, sizeof(modbus_fields) / sizeof(modbus_fields[0])},
        {"s7", s7_fields, sizeof(s7_fields) / sizeof(s7_fields[0])},
        {"opcua", opcua_fields, sizeof(opcua_fields) / sizeof(opcua_fields[0])},
        {"profinet", profinet_fields, sizeof(profinet_fields) / sizeof(profinet_fields[0])},
        {"ethernetip", ethernetip_fields, sizeof(ethernetip_fields) / sizeof(ethernetip_fields[0])}
    };

    bool changed = false;
    for (const auto& def : defaults) {
        cJSON* protocol = cJSON_GetObjectItem(plugins, def.name);
        if (!protocol) {
            protocol = cJSON_CreateObject();
            cJSON_AddItemToObject(plugins, def.name, protocol);
            changed = true;
        }

        for (size_t i = 0; i < def.field_count; ++i) {
            const ProtocolField& field = def.fields[i];
            if (!cJSON_GetObjectItem(protocol, field.key)) {
                if (field.is_bool) {
                    cJSON_AddBoolToObject(protocol, field.key, strcmp(field.value, "true") == 0);
                } else {
                    cJSON_AddStringToObject(protocol, field.key, field.value);
                }
                changed = true;
            }
        }
    }

    // Ensure reporting_endpoints/file exists (default for fuzzing events)
    if (changed) {
        char* updated_json = cJSON_Print(root_);
        if (updated_json) {
            raw_ = PSRAMUtils::createPSRAMString(updated_json);
            saveConfigJSON(raw_);
            free(updated_json);
            //LOG_INFO("Config", "Updated configuration with missing protocol fields and reporting endpoints");
        }
    }
}


static inline size_t config_json_len_bytes(void) {
    return sizeof(esp32_ot_generated::kEmbeddedConfigJson) - 1;
}

// come C-string (null-terminated)
static inline const char* config_json_cstr(void) {
    return esp32_ot_generated::kEmbeddedConfigJson;
}

bool ConfigurationManager::loadDevConfigFromSource() {
    LOG_INFO("Config", "🔧 Loading embedded development configuration");

    // Check if embedded config is available
    size_t config_len = config_json_len_bytes();
    if (config_len == 0) {
        LOG_WARNING("Config", "No embedded configuration found");
        return false;
    }

    // Get embedded config content
    std::string embedded_json(config_json_cstr(), config_len);
    //LOG_INFOF("Config", "Found embedded config: %u bytes", (unsigned)embedded_json.length());

    // Validate JSON format
    PSRAMJsonParser::PSRAMContext test_ctx;
    cJSON* test_parse = PSRAMJsonParser::parseInPSRAM(embedded_json.c_str(), embedded_json.size());
    if (!test_parse) {
        LOG_ERROR("Config", "❌ Embedded configuration contains invalid JSON");
        return false;
    }
    cJSON_Delete(test_parse);

    // Load directly into memory (don't save to filesystem yet)
    if (root_) cJSON_Delete(root_);
    {
        PSRAMJsonParser::PSRAMContext ctx;
        root_ = PSRAMJsonParser::parseInPSRAM(embedded_json.c_str(), embedded_json.size());
    }
    if (!root_) {
        LOG_ERROR("Config", "❌ Failed to parse embedded configuration");
        return false;
    }

    // Update raw cache
    raw_ = PSRAMUtils::createPSRAMString(embedded_json.c_str());

    // Parse and cache the configuration values
    if (!parseAndCache(root_)) {
        LOG_ERROR("Config", "❌ Failed to parse embedded configuration");
        return false;
    }

    LOG_INFO("Config", "✅ Embedded development configuration loaded and parsed successfully");
    return true;
}

std::string ConfigurationManager::getConfigSourceName() const {
    switch (config_source_) {
        case ConfigSource::DEFAULT: return "Default";
        case ConfigSource::EMBEDDED: return "Embedded";
        case ConfigSource::FILESYSTEM: return "Filesystem";
        case ConfigSource::WEB_INTERFACE: return "Web Interface";
        default: return "Unknown";
    }
}

bool ConfigurationManager::resetToEmbeddedConfig() {
    LOG_INFO("Config", "🔄 Resetting to embedded configuration");

    // Load embedded config
    if (!loadDevConfigFromSource()) {
        LOG_ERROR("Config", "❌ Failed to load embedded configuration for reset");
        return false;
    }

    // Save to filesystem to persist the reset
    if (!saveConfigJSON(raw_)) {
        LOG_ERROR("Config", "❌ Failed to save embedded configuration to filesystem");
        return false;
    }

    // Update source tracking to reflect the reset
    saveConfigSourceToNVS(ConfigSource::EMBEDDED);

    //LOG_INFO("Config", "✅ Successfully reset to embedded configuration");
    return true;
}
